In [1]:
#TO remove :
import os
directory = os.getcwd()
print(directory)

C:\Users\s1114237\OneDrive - Syngenta\Formations\Training\EPFL extension school\Machine_Learning_EPFL-extension-school\Course#2 Data Analysis

In [1]:
os.chdir("Machine_Learning_EPFL-extension-school\Course#2 Data Analysis")
directory = os.getcwd()
print(directory)

NameError: name 'os' is not defined

# Manipulatind Data
## Concatenating 

The simplest way to combine two data frames is just to concatenate them, or glue them together. We can do this along either axis, more specifically we can choose:

- axis=0 meaning that we glue them one on top of the other, creating more rows.
- axis=1 meaning that we glue them side by side, creating more columns.

Let’s look at some examples. We import our libraries

In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame(np.full((2, 3), "x", dtype=object), columns=["A", "B", "C"])
df1

   A  B  C
0  x  x  x
1  x  x  x

In [4]:
df2 = pd.DataFrame(np.full((3, 3), "o", dtype=object), columns=["A", "B", "C"])
df2

   A  B  C
0  o  o  o
1  o  o  o
2  o  o  o

In [5]:
df3 = pd.DataFrame(np.full((2, 2), "v", dtype=object), columns=["D", "E"])
df3

   D  E
0  v  v
1  v  v

Now we have 3 dataframes. 

### Concatenation along axis 0

The default parameter for concatenation is axis=0 that tells pandas to stack the second DataFrame under the first one. Pandas will check for us whether the column names are the same or not. If they are, then it will just stack them directly underneath each other so that the columns line up. Let’s try this out with df1 and df2 which have the same column names

In [6]:
pd.concat([df1, df2])

   A  B  C
0  x  x  x
1  x  x  x
0  o  o  o
1  o  o  o
2  o  o  o

You can see that we call the concat() function from pandas and pass the two DataFrames as a list inside square brackets and separated by a comma.

Pandas correctly stacked the columns on top of each other. Notice that the original indexing from each DataFrame was kept. We can reindex the concatenated DataFrame using the reset_index() method with the parameter drop=True which tells pandas to generate a new index and drop the old one. Let’s give this a try:

In [7]:
pd.concat([df1, df2]).reset_index(drop=True)

   A  B  C
0  x  x  x
1  x  x  x
2  o  o  o
3  o  o  o
4  o  o  o

If we try to concatenate DataFrames that do not have the same columns, or maybe some columns are the same and some are not, pandas will keep all columns, but for the columns which are not in both DataFrames, NaN values will be filled in. Here is an example:

In [8]:
pd.concat([df1, df3])

     A    B    C    D    E
0    x    x    x  NaN  NaN
1    x    x    x  NaN  NaN
0  NaN  NaN  NaN    v    v
1  NaN  NaN  NaN    v    v

Here, the two DataFrames have no column in common, so each column is listed and the values which are missing are filled with NaN.

### The keys parameter

Suppose that after concatenating the DataFrames, we still want to have the data from each DataFrame in a separate group. This can be useful for determining later on which DataFrame a certain entry came from. We can achieve this with the keys parameter which creates a hierarchical index on the DataFrame. A hierarchical index means that we can have more than one index for each row or observation. This is typically thought of as having different levels, with the first index on the first level, and then possibly other indices on the next levels. Let’s look at the example of concatenating df1 and df2 once again, but this time with the use of the keys parameter:


*This command assigns to each row from df1 a second index of df1, and to each row from df2 a second index of df2. Here is the result*

In [9]:
df4 = pd.concat([df1, df2], keys=["df1", "df2"])
df4

       A  B  C
df1 0  x  x  x
    1  x  x  x
df2 0  o  o  o
    1  o  o  o
    2  o  o  o

We can now use these secondary labels to get back the rows that came from each DataFrame, using the usual loc function for selection by index. For example, we can get the rows from df2 as follows:

In [10]:
df4.loc["df2", :]

   A  B  C
0  o  o  o
1  o  o  o
2  o  o  o

### Concatenating along axis 1
Now let’s look at the second way of concatenating two DataFrames: side by side. This type of concatenation will first align by row index labels of each DataFrame, and then put in the columns of the first DataFrame followed by the columns of the second. Here is an example:

In [11]:
pd.concat([df1, df3], axis=1)

   A  B  C  D  E
0  x  x  x  v  v
1  x  x  x  v  v

These two DataFrames both have two rows, and the rows have the same labels, so the concatenation just glues them side by side.

If instead we tried concatenation of df1 and df2, we would get:

In [12]:
pd.concat([df1, df2], axis=1)

     A    B    C  A  B  C
0    x    x    x  o  o  o
1    x    x    x  o  o  o
2  NaN  NaN  NaN  o  o  o

Since the first two rows were in common, they were glued side by side. But because the first DataFrame did not have a third row, NaN values were used to fill in these entries.

### The join parameter

The concat() function has another useful parameter called join. Here, we can use either the default setting which is join='outer', or instead we can choose to use join='inner'. What is the difference between them? We can think of the join='outer' as a union of the indices or labels (depending on along which axis we perform the concatenation). This is what we have seen so far. The row indices or column labels that were in common were not duplicated, and those that were not in common were each added separately with the appropriate NaN values. On the other hand, join='inner' refers to the intersection of row indices or column labels. That is, we keep only those that are in common, and discard the rest. Here is the previous example, but this time with join='inner':

In [13]:
pd.concat([df1, df2], axis=1, join="inner")

   A  B  C  A  B  C
0  x  x  x  o  o  o
1  x  x  x  o  o  o

Since only the first two rows were in common, only these were kept. The third row of the second DataFrame - the one which previously had NaN values - was discarded. What if there are no row indices or column labels in common at all?

In [15]:
pd.concat([df1, df3], join="inner")

Empty DataFrame
Columns: []
Index: [0, 1, 0, 1]

The result is an empty DataFrame that has only the row indices.

This completes our overview of the concat() function. In the next unit, we look at more complex ways of combining DataFrames.

## Merging and Joining

So far we have seen how to combine DataFrames using the concat() function. This function allowed us to combine different DataFrames along their row index or column label. In this unit, we look at an extension of this using the merge() function. The main role of the merge() function is to allow us to combine DataFrames along multiple columns, or along columns other than the index.

### Merging on a single column
The first type of merging that we will consider is also the simplest. This is where we have two DataFrames that have a column in common and we want to merge along this column. Let’s define the two DataFrames:

In [16]:
import pandas as pd

users = pd.DataFrame(
    {
        "userID": [5672, 3452, 2878, 3234],
        "First Name": ["Christopher", "Johnnie", "Debbie", "Teri"],
        "Last Name": ["Boyd", "Baldwin", "Alvarez", "Gill"],
    }
)
users

   userID   First Name Last Name
0    5672  Christopher      Boyd
1    3452      Johnnie   Baldwin
2    2878       Debbie   Alvarez
3    3234         Teri      Gill

In [17]:
scores = pd.DataFrame(
    {"userID": [2878, 5672, 3234, 5672, 2878], "Score": [84, 56, 72, 77, 88]}
)
scores

   userID  Score
0    2878     84
1    5672     56
2    3234     72
3    5672     77
4    2878     88

The first DataFrame contains a list of users’ names and IDs, and the second has test scores of different users. Note in particular that more than one test score is available for certain users. We would like to merge the two DataFrames so that we can associate each test score with the first and last name of the corresponding user. In pandas, we can easily do this using the merge() function as follows:

In [18]:
merged_df = pd.merge(users, scores)
merged_df

   userID   First Name Last Name  Score
0    5672  Christopher      Boyd     56
1    5672  Christopher      Boyd     77
2    2878       Debbie   Alvarez     84
3    2878       Debbie   Alvarez     88
4    3234         Teri      Gill     72

Pandas has found by itself the column which is in common between the two DataFrames, which is the userID column. It has then merged the two DataFrames according to this column. This worked because the columns had the same label. But what if this is not the case? Consider instead the following alternative definition of the second DataFrame:

In [19]:
scores2 = pd.DataFrame(
    {"studentID": [2878, 5672, 3234, 5672, 2878], "Score": [84, 56, 72, 77, 88]}
)
scores2

   studentID  Score
0       2878     84
1       5672     56
2       3234     72
3       5672     77
4       2878     88

We’ve now changed the label of the userID column to studentID, so it no longer matches with the users DataFrame. If we try the same command as before, we get an error from pandas:

In [20]:
pd.merge(users, scores2)
# MergeError: No common columns to perform merge on

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

which tells us that there are no columns in common. However, if we have prior knowledge of this, we can actually specify to pandas which columns we want the merge to be based on as follows

In [21]:
pd.merge(users, scores2, left_on="userID", right_on="studentID")

   userID   First Name Last Name  studentID  Score
0    5672  Christopher      Boyd       5672     56
1    5672  Christopher      Boyd       5672     77
2    2878       Debbie   Alvarez       2878     84
3    2878       Debbie   Alvarez       2878     88
4    3234         Teri      Gill       3234     72

This will look at the entries in the userID column of the left DataFrame, users, and try to match them with the entries in the studentID column of the right DataFrame, scores2. Notice that both columns are retained in the merged DataFrame.

We can, of course, drop one of them if we wish.

### Merging on multiple columns
Now, let’s consider DataFrames with more than one column in common. Let’s define a new example: we have two DataFrames containing the top four countries at the 2010 Winter Olympics in terms of gold and bronze medals, respectively: